Documents/ВводВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВводВЭксплуатацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьАК_НачислениеАмортизации</xr:Item>
				<xr:Item>InformationRegister.ПринятыеКУчетуОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременноТекстЗапросаВнешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВводВЭксплуатацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВвода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизационнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписываетсяВМоментВвода</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаАмортизации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНМА</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийВводВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВводВЭксплуатацию</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатациюОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатациюНМА</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводВЭксплуатацию/Forms/ФормаЗаполненияТЧ/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("АмортизационнаяГруппа"		, АмортизационнаяГруппа);
	Результат.Вставить("РежимЗаполнения"			, РежимЗаполнения);
	Результат.Вставить("СрокПолезногоИспользования"	, СрокПолезногоИспользования);
	Результат.Вставить("КодПоОКОФ"					, КодПоОКОФ);
	Результат.Вставить("ГруппаОС"					, ГруппаОС);
	Результат.Вставить("ВидНМА"						, ВидНМА);
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры 

Процедура УстановитьУсловноеОформление()
	
	Элементы.СрокПолезногоИспользования.Видимость 	= ПоказыватьСрок;
	Элементы.РежимЗаполнения.Видимость 				= ПоказыватьРежим;
	
	Если ВыбранноеПоле <> "" Тогда
		
		Элементы.АмортизационнаяГруппа.Видимость 		= Ложь;
		Элементы.ГруппаОС.Видимость              		= Ложь;
		Элементы.КодПоОКОФ.Видимость		     		= Ложь;
		Элементы.СрокПолезногоИспользования.Видимость  	= Ложь;
		//+++АК Susk (Суслин К.В.) 2018.10.08 ИП-00020055	 
		Элементы.ВидНМА.Видимость  						= Ложь;
		//---АК Susk (Суслин К.В.) 		
		
		Если ВыбранноеПоле =  Врег("ОборудованиеАмортизационнаяГруппаОС")
				ИЛИ	ВыбранноеПоле =  Врег("ОсновныеСредстваАмортизационнаяГруппаОС") Тогда
			Элементы.АмортизационнаяГруппа.Видимость = Истина;
		КонецЕсли;	
			
		Если ВыбранноеПоле =  Врег("ОборудованиеГруппаОС")
				ИЛИ ВыбранноеПоле =  Врег("ОсновныеСредстваГруппаОС") Тогда
			Элементы.ГруппаОС.Видимость = Истина;			
		КонецЕсли;	
		
		Если ВыбранноеПоле =  Врег("ОборудованиеКодПоОКОФ")
				ИЛИ ВыбранноеПоле =  Врег("ОсновныеСредстваКодПоОКОФ") Тогда
			Элементы.КодПоОКОФ.Видимость = Истина;			
		КонецЕсли;
		
		//+++АК Susk (Суслин К.В.) 2018.10.08 ИП-00020055	 
		Если ВыбранноеПоле =  Врег("ОборудованиеВидНМА")
				ИЛИ ВыбранноеПоле =  Врег("ОсновныеСредстваВидНМА") Тогда
			Элементы.ВидНМА.Видимость = Истина;			
		КонецЕсли;
		//---АК Susk (Суслин К.В.) 
		
		Если ВыбранноеПоле =  Врег("ОборудованиеСрокПолезногоИспользования")
				ИЛИ ВыбранноеПоле =  Врег("ОсновныеСредстваСрокПолезногоИспользования") Тогда
			Элементы.СрокПолезногоИспользования.Видимость = Истина;
		КонецЕсли;
		
	//+++АК Susk (Суслин К.В.) 2018.10.08 ИП-00020055
	Иначе
		ВводНМА = ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВводВЭксплуатацию.ВводВЭксплуатациюНМА");
		
		Элементы.ГруппаОС.Видимость              		= НЕ ВводНМА;
		Элементы.КодПоОКОФ.Видимость		     		= НЕ ВводНМА;		
		Элементы.ВидНМА.Видимость  						= ВводНМА;
	//---АК Susk (Суслин К.В.) 			
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК Susk (Суслин К.В.) 2018.10.08 ИП-00020055	 
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ВидОперации;
	КонецЕсли;
	//---АК Susk (Суслин К.В.) 
	
	Если Параметры.Свойство("ВыбранноеПоле") Тогда	
		ВыбранноеПоле = Параметры.ВыбранноеПоле;
	Иначе 
		ВыбранноеПоле = "";
	КонецЕсли;	
		
	Если Параметры.Свойство("ПоказыватьСрок") Тогда
		ПоказыватьСрок = Параметры.ПоказыватьСрок;
	Иначе 
		ПоказыватьСрок = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ПоказыватьРежим") Тогда
		ПоказыватьРежим = Параметры.ПоказыватьРежим;
	Иначе 
		ПоказыватьРежим = Истина;
	КонецЕсли;

	Если Параметры.Свойство("РежимЗаполнения") Тогда
		РежимЗаполнения = Параметры.РежимЗаполнения;
	Иначе 
		РежимЗаполнения = "Выделенные";
	КонецЕсли;
	
	Если Параметры.Свойство("АмортизационнаяГруппа") Тогда
		АмортизационнаяГруппа = Параметры.АмортизационнаяГруппа;
	Иначе 
		АмортизационнаяГруппа = Перечисления.АмортизационныеГруппы.ПустаяСсылка();
	КонецЕсли;
	
	Если Параметры.Свойство("КодПоОКОФ") Тогда
		КодПоОКОФ = Параметры.КодПоОКОФ;
	Иначе 
		КодПоОКОФ = Справочники.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка();
	КонецЕсли;

	Если Параметры.Свойство("ГруппаОС") Тогда
		ГруппаОС = Параметры.ГруппаОС;
	Иначе 
		ГруппаОС = Перечисления.ГруппыОС.ПустаяСсылка();
	КонецЕсли;
	
	//+++АК Susk (Суслин К.В.) 2018.10.08 ИП-00020055	 
	Если Параметры.Свойство("ВидНМА") Тогда
		ВидНМА = Параметры.ВидНМА;
	Иначе 
		ВидНМА = Перечисления.ВидыНМА.ПустаяСсылка();
	КонецЕсли;
	//---АК Susk (Суслин К.В.) 
	
	Если Параметры.Свойство("СрокПолезногоИспользования") Тогда
		СрокПолезногоИспользования = Параметры.СрокПолезногоИспользования;
	Иначе 
		СрокПолезногоИспользования = 0;
	КонецЕсли;
	
	//
	УстановитьУсловноеОформление();
	
КонецПроцедуры
	

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
